content-org/blog.org
#+title: Boyang Yan's Blog
#+hugo_base_dir: ~/blog/
#+hugo_section: posts
#+hugo_front_matter_format: yaml

** DONE Arch Linux/Manjaro sound and sound card configuration :arch:linux:manjaro:sound:card:
CLOSED: [2021-12-20 Mon 19:04]
:PROPERTIES:
:EXPORT_FILE_NAME: configSound
:EXPORT_OPTIONS: author:nil
:END:

*** Introduction
After install Arch Linux/Manjaro, although alsa-utils has been installed, it may still not play sound correctly. Here is a solution.

*** First try
#+begin_src bash
amixer sset Master unmute
#+end_src

If you use alsamixer to unmute the master sound, you still can't play the sound.

Please, following the steps at the below.

*NOTE*: If you faced maixer: Unable to find simple cintrol 'Master', 0, that means, it maybe that the sound card device cannot be found or the sound card driver us not installed.

*** Finding sound card ID and set-up .asoundrc file
Using below commands to get the sound card ID and device ID of the sound card you want to use.

#+begin_src bash
aplay -l
#+end_src

There is a example for select the sound card with the sound card ID of 1 and the device ID of 0 for configuration.

Add the following three lines to the configuration file ~/.asoundrc

#+begin_example
defaults.pcm.card 1
defaults.pcm.device 0
defaults.ctl.card 1
#+end_example

The *PCM* option determines the device used to play audio, and the *CTL* option determines which sound card can be used by the control tool (alsamixer)

If you want to manage configuration files in a unified way, please have a read [[id:5daeba1f-2aa5-492a-b3e7-3343722def0b][Linux/Managing Your Dotfiles With Git and Make]].


